app/controllers/admin/categories_controller.rb

  def create
    @admin_category = Admin::Category.new(handle_params)

    respond_to do |format|
      if @admin_category.save
---
INSERT INTO `admin_categories` (`name`, `father_id`, `level`, `weight`, `code`, `created_at`, `updated_at`) VALUES ('tag', 8, 3, 1, '4', '2015-11-19 05:55:12', '2015-11-19 05:55:12')

  def update

    respond_to do |format|
      if @admin_category.update(handle_params)
---
UPDATE `admin_categories` SET `name` = 'loding', `father_id` = 12, `level` = 1, `code` = '0111', `updated_at` = '2015-11-19 12:50:56' WHERE `admin_categories`.`id` = 12

  def destroy
    destroy_all_subs @admin_category.destroy
---
DELETE FROM `admin_categories` WHERE `admin_categories`.`id` = 1