app/controllers/admin/messages_controller.rb

  def create
    prms = admin_message_params
    prms[:abstract] = prms[:content][0,100]
    @admin_message = Admin::Message.new(prms)
    respond_to do |format|
      if @admin_message.save
---
INSERT INTO `admin_messages` (`title`, `content`, `author`, `tag`, `category_id`, `user_id`, `abstract`, `created_at`, `updated_at`) VALUES ('大师傅', '<p>&nbsp;</p>\r\n\r\n<blockquote>\r\n<p>asd飞asd飞</p>\r\n</blockquote>\r\n\r\n<p>asd飞</p>\r\n', 'root', 'asdf,fdsa', 18, 1, '<p>&nbsp;<', '2015-11-19 12:46:51', '2015-11-19 12:46:51')

  def update
    prms = admin_message_params
    @admin_message.remove_category
    prms[:abstract] = prms[:content].strip[0,10]
    respond_to do |format|
      if @admin_message.update(prms)
---
UPDATE `admin_messages` SET `abstract` = '<p>asdf&nb', `updated_at` = '2015-11-18 12:12:00' WHERE `admin_messages`.`id` = 1

  def destroy
    @admin_message.destroy
---
DELETE FROM `admin_messages` WHERE `admin_messages`.`id` = 1

  def batch_destroy
    message_ids = params[:id].split(",").flatten
    if message_ids.nil?||message_ids.empty?
      respond_to do |format|
        format.html { redirect_to admin_messages_url,notice:'未选择用户！'}
        format.json { head :no_content }
      end
    else
      message_ids.each do |id|
        Admin::Message.find(id).destroy
---
DELETE FROM `admin_messages` WHERE `admin_messages`.`id` = 1