app/controllers/admin/tags_controller.rb

INSERT INTO `admin_tags` (`name`, `code`, `created_at`, `updated_at`) VALUES ('默认', 0, '2015-11-18 09:37:53', '2015-11-18 09:37:53')
---
  def create
    @admin_tag = Admin::Tag.new(admin_tag_params)

    respond_to do |format|
      if @admin_tag.save

DELETE FROM `admin_tags` WHERE `admin_tags`.`id` = 1
---
  def destroy
    @admin_tag.destroy