app/controllers/admin/users_controller.rb

INSERT INTO `admin_users` (`username`, `realname`, `password_digest`, `email`, `created_at`, `updated_at`) VALUES ('asdf', 'asdf', '$2a$10$x9DutS4g18MdeWatO/Lp/.yAau.vA/2pLvj7HF0IU56dWfB7zJqsu', '', '2015-11-16 14:48:53', '2015-11-16 14:48:53')
---
  def create
    @admin_user = Admin::User.new(admin_user_params)

    respond_to do |format|
      if @admin_user.save

DELETE FROM `admin_users` WHERE `admin_users`.`id` = 2
---
  def destroy
    @admin_user.destroy

DELETE FROM `admin_users` WHERE `admin_users`.`id` = 3
---
  def batch_destroy
    user_ids = params[:id].split(",").flatten
    if user_ids.nil?||user_ids.empty?
      respond_to do |format|
        format.html { redirect_to admin_users_url,notice:'未选择用户！'}
        format.json { head :no_content }
      end
    else
      user_ids.each do |id|
        Admin::User.find(id).destroy