app/views/admin/categories/index.html.erb

SELECT `admin_categories`.* FROM `admin_categories` WHERE `admin_categories`.`father_id` = 0
---
    <% @admin_categories.each do |admin_category| %>
      <% admin_category_subs = Admin::Category.where(father_id:admin_category.id) %>